# 1. Візьміть гру з заняття і доопрацюйте її наступним чином:
# - всі функції в окремий файл
# - додайте підказки привгадуванні (якщо різниця між числом користувача і загаданим більше 10 - вивести "Холодно", якщо 5-10 - "Тепло", якщо 1-4 "Гаряче")
# - додайте можливість на початку програми вказати кількість спроб вгадування. користувач має вгадати число за вказану кількість спроб
# 2. Напишіть декоратор, який вимірює і виводить на екран час виконання функції в секундах і задекоруйте ним основну функцію гри. Після закінчення гри декоратор має сповістити, скільки тривала гра.

55
from Functional_9 import time_decorator, get_random_number, get_number_from_user, check_numbers, game
game()



